[
  {
    "title": "Learning Theories and Cognitive Frameworks",
    "description": "Theoretical frameworks that explain how individuals acquire, process, and apply knowledge, including cognitive, constructivist, and metacognitive perspectives."
  },
  {
    "title": "Instructional Design and Pedagogical Frameworks",
    "description": "Frameworks guiding the design, implementation, and evaluation of teaching and learning practices, including scaffolding, formative assessment, and inquiry teaching."
  },
  {
    "title": "Disciplinary and Epistemic Frameworks",
    "description": "Frameworks addressing the nature, structure, and practices of scientific disciplines and knowledge construction, including epistemic games and disciplinary authenticity."
  },
  {
    "title": "Teacher Knowledge and Professional Development Frameworks",
    "description": "Frameworks focusing on teachers' specialized knowledge, professional growth, and instructional decision-making processes."
  },
  {
    "title": "Educational Systems and Organizational Frameworks",
    "description": "Frameworks analyzing educational contexts, systemic change, organizational culture, and multi-level influences on teaching and learning."
  },
  {
    "title": "Assessment and Measurement Frameworks",
    "description": "Frameworks related to the design, interpretation, and use of assessments and measurement principles in education."
  },
  {
    "title": "Motivation, Affect, and Psychological Frameworks",
    "description": "Frameworks addressing learners' beliefs, motivation, mindsets, self-efficacy, and affective factors influencing learning outcomes."
  },
  {
    "title": "Representation and Communication Frameworks",
    "description": "Frameworks focusing on the use, generation, and interpretation of multiple representations, language, and discourse in learning and teaching."
  },
  {
    "title": "Complexity, Systems, and Emergence Frameworks",
    "description": "Theoretical perspectives emphasizing complex adaptive systems, emergent phenomena, and dynamic interactions in learning and knowledge development."
  },
  {
    "title": "Sociocultural, Identity, Equity and Social Justice Frameworks",
    "description": "Frameworks that focus on social, cultural, and community influences on learning and identity development, with an emphasis on power relations, systemic inequities, identity intersections, and inclusive pedagogies."
  }
]